Repository: Suiram1701/SchulPlanerBot
Catalog: SchulPlanerBot/Localization/ApplicationCommands.*.resx
Languages: de

# schulplaner.description
source: Manages settings of the bot on the guild.
de: Verwaltet die Einstellungen des Bots auf diesem Server.

# schulplaner.settings.name
source: settings
de: einstellungen

# schulplaner.settings.description
source: Retrieves the settings configured for the guild.
de: Ruft die Einstellungen für den Bot auf diesem Server ab.

# homeworks.name
source: homeworks
de: hausaufgaben

# homeworks.description
source: Manages homeworks on the guild.
de: Verwaltet Hausaufgaben auf diesem Server.

# homeworks.list.name
source: list
de: liste

# homeworks.list.description
source: Gets all homeworks within the specified range or homeworks of a specific subject.
de: Listet alle Hausaufgaben innerhalb des angegebenen Zeitraums oder eines bestimmten Fachs auf.

# homeworks.list.start.description
source: The start date time of the range. By default the current date. E.g.: 01.01.2020 10:00 or just 10:00.
de: Der Start des Zeitraums. Standartmäßig das aktuelle Datum. z.B.: 01.01.2020 10:00 oder 10:00.

# homeworks.list.end.name
source: end
de: ende

# homeworks.list.end.description
source: The end date time of the range. By default one week into the future. E.g.: 01.01.2020 or just 10:00.
de: Das Ende des Zeitraums. Standartmäßig in einer Woche. z.B.: 01.01.2020 oder 10:00.

# homeworks.list.subject.name
source: subject
de: fach

# homeworks.list.subject.description
source: The subject to retrieve the homeworks of. Leave empty to not filter.
de: Das Fach dessen Hausaufgaben abgerufen werden sollen. Leerlassen um nicht danach zu filtern.

# homeworks.create.name
source: create
de: erstellen

# homeworks.create.description
source: Opens the dialog to create a new homework.
de: Öffnet das Formular zum erstellen einer Hausaufgabe.

# homeworks.delete.name
source: delete
de: löschen

# homeworks.delete.description
source: Deletes a homework by its ID. A homework can only be deleted by its creator or a mod.
de: Löscht eine Hausaufgabe anhand ihrer ID. Kann nur von ihrem Ersteller oder einem Mod gemacht werden.

# homeworks.delete.id.description
source: The ID of the homework to remove.
de: Die ID der zu entfernenden Hausaufgabe. Wenn leer wird danach gefragt.

# homeworks.modify.name
source: edit
de: bearbeiten

# homeworks.modify.description
source: Opens the dialog to modify an existing homework. Can only be done by its creator or a mod.
de: Öffnet den Dialog zum bearbeiten einer Hausaufgabe. Nur vom Ersteller oder einem Mod durchführbar.

# homeworks.modify.id.description
source: The ID of the homework to modify.
de: Die ID der zu bearbeitenden Hausaufgabe. Wenn leer wird nach dieser gefragt.

# homeworks.subscribe-all.name
source: subscribe-all
de: alle-abonnieren

# homeworks.unsubscribe-all.name
source: unsubscribe-all
de: alle-deabonnieren

# homeworks.subscribe.name
source: subscribe
de: abonnieren

# homeworks.unsubscribe.name
source: unsubscribe
de: deabonnieren

# homeworks.subscribe.description
source: Subscribes to notifications from specific subjects or no subject.
de: Abonniert Benachrichtigungen für bestimmte Fächer.

# homeworks.subscribe-all.description
source: Subscribes to notifications for all subjects.
de: Abonniert Benachrichtigungen für alle Fächer.

# homeworks.unsubscribe-all.description
source: Unsubscribes from notifications of all subjects. Manuel added subjects will remain.
de: Deabonniert Benachrichtigungen für alle Fächer. Manuell hinzugefügte Fächer verbleiben.

# homeworks.subscribe.no-subject.description
source: Receive notification for homeworks without a subject. Can't unsubscribe from this with false.
de: Erhalten Sie Benachrichtigungen für Hausaufgaben bei dehnen kein Fach angegeben ist.

# homeworks.subscribe.subjects.name
source: subjects
de: fächer

# homeworks.subscribe.subjects.description
source: Subjects you will receive notifications for. Separate theme using , or ;.
de: Fächer für Sie Benachrichtigungen erhalten werden. Trennen Sie diese mit , oder ;.

# homeworks.subscribe.no-subject.name
source: no-subject
de: kein-fach

# homeworks.unsubscribe.description
source: Unsubscribes from notifications of specific subjects or no subject.
de: Deabonniert Benachrichtigungen für alle angegebenen Fächer.

# homeworks.unsubscribe.subjects.name
source: subjects
de: fächer

# homeworks.unsubscribe.subjects.description
source: Subjects you no longer will receive notification for. Separate theme using , or ;.
de: Fächer für die Sie keine Benachrichtigungen mehr erhalten werden. Trennen Sie diese mit , oder ;.

# homeworks.unsubscribe.no-subject.name
source: no-subject
de: kein-fach

# homeworks.unsubscribe.no-subject.description
source: Indicates whether notification from homeworks without a subject should be disabled.
de: Gibt an, ob Benachrichtigungen von Hausaufgaben ohne Fach deaktiviert werden sollen.

# homeworks.subscriptions.name
source: subscriptions
de: abonnements

# homeworks.subscriptions.description
source: Shows your homework notification subscriptions.
de: Zeigt Ihre Benachrichtigungs Abonnements.

# schulplaner.delete-homeworks.name
source: delete-homeworks
de: hausaufgaben-löschen

# schulplaner.delete-homeworks.description
source: Sets the time a homework gets deleted after its due.
de: Setzt die Zeit nach der eine Hausaufgabe nach ihrer Fälligkeit gelöscht wird.

# schulplaner.delete-homeworks.after.name
source: after-due
de: nach-fälligkeit

# schulplaner.delete-homeworks.after.description
source: The time a homework will be deleted after its due.
de: Die Zeit zwischen der Fälligkeit einer Hausaufgabe und ihrer Lösung.

# homeworks.list.search.name
source: search
de: suche

# homeworks.list.search.description
source: A term to search for in the title or description.
de: Ein Begriff, nach dem im Titel oder in der Beschreibung gesucht werden soll.

# help.name
source: help
de: hilfe

# help.description
source: Retrieves information for help with this bot.
de: Ruft Informationen zur Hilfe mit diesem Bot ab.

# schulplaner.locale.name
source: locale
de: sprache

# schulplaner.locale.culture.name
source: locale
de: sprache

# schulplaner.locale.description
source: Configures the locale that will be used in notifications. Execute without locale to reset it.
de: Die Sprache, die für Benachrichtigungen benutzt wird. Zum zurücksetzten ohne Sprache ausführen.

# schulplaner.locale.culture.description
source: The locale to set. Empty to clear it.
de: Die zusetzende Sprache. Leer lassen um diese zu zurückzusetzen.

# schulplaner.add-notification.name
source: add-notification
de: benachrichtigung-hinzufügen

# schulplaner.add-notification.channel.name
source: channel
de: kanal

# schulplaner.add-notification.description
source: Adds a notification with certain parameters to this guild.
de: Fügt eine Benachrichtigung mit bestimmten Parametern hinzu.

# schulplaner.add-notification.channel.description
source: The channel to post notifications in. Must be a text channel.
de: Der Kanal in dem die Benachrichtigungen geposted werden sollen. Muss ein Textkanal sein.

# schulplaner.remove-notification.name
source: remove-notification
de: benachrichtigung-entfernen

# schulplaner.remove-notification.description
source: Removes a single notification from this guild.
de: Entfernt eine Benachrichtigung von diesem Server.

# schulplaner.add-notification.objects-in.name
source: objects-in
de: objekte-in

# schulplaner.add-notification.objects-in.description
source: The max due of objects (homeworks, etc.) from the notification. E.g.: 1d. By default between.
de: Die maximale Fälligkeit von Objekten (Hausaufgaben, usw.) von der Benachrichtigung aus. z.B.: 1d.

# schulplaner.add-notification.cron.name
source: cron-expression
de: cron-ausdruck

# schulplaner.add-notification.cron.description
source: An expression which specifies when the notification should be done. Isn't the regular UNIX style.
de: Ein Ausdruck, der angibt wann die Benachrichtigung gemacht werden soll. Weicht vom UNIX Still ab.

# schulplaner.remove-notification.channel.name
source: channel
de: kanal

# schulplaner.remove-notification.channel.description
source: The channel whose notification should be removed.
de: Der Kanal dessen Benachrichtigung entfernt werden soll.
